{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_defaultpreprocess17_init_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "Constant__defaultpreprocess17_init_mean_139640430596304", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1, 1, 1, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_sub", 
      "name": "_defaultpreprocess17_broadcast_minus0", 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_defaultpreprocess17_init_scale", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "Constant__defaultpreprocess17_init_scale_139640430065424", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1, 1, 1, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_div", 
      "name": "_defaultpreprocess17_broadcast_div0", 
      "inputs": [[2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "_defaultpreprocess17_transpose0", 
      "attrs": {"axes": "(0, 3, 1, 2)"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16, 3, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mobilenetv20_features_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mobilenetv20_features_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 36], [11, 0, 36]]
    }, 
    {
      "op": "clip", 
      "name": "mobilenetv20_features_relu60_relu6", 
      "attrs": {
        "a_max": "6", 
        "a_min": "0"
      }, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck0_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16, 16, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mobilenetv20_features_linearbottleneck0_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck0_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck0_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck0_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck0_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mobilenetv20_features_linearbottleneck0_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0], [18, 0, 36], [19, 0, 36]]
    }, 
    {
      "op": "clip", 
      "name": "mobilenetv20_features_linearbottleneck0_relu60_relu6", 
      "attrs": {
        "a_max": "6", 
        "a_min": "0"
      }, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck0_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16, 1, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mobilenetv20_features_linearbottleneck0_conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck0_batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck0_batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck0_batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck0_batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mobilenetv20_features_linearbottleneck0_batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0], [26, 0, 36], [27, 0, 36]]
    }, 
    {
      "op": "clip", 
      "name": "mobilenetv20_features_linearbottleneck0_relu61_relu6", 
      "attrs": {
        "a_max": "6", 
        "a_min": "0"
      }, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck0_conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(8, 16, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mobilenetv20_features_linearbottleneck0_conv2_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "8", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck0_batchnorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(8,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck0_batchnorm2_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(8,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck0_batchnorm2_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(8,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck0_batchnorm2_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(8,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mobilenetv20_features_linearbottleneck0_batchnorm2_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[31, 0, 0], [32, 0, 0], [33, 0, 0], [34, 0, 36], [35, 0, 36]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck1_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(48, 8, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mobilenetv20_features_linearbottleneck1_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "48", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck1_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(48,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck1_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(48,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck1_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(48,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck1_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(48,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mobilenetv20_features_linearbottleneck1_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[38, 0, 0], [39, 0, 0], [40, 0, 0], [41, 0, 36], [42, 0, 36]]
    }, 
    {
      "op": "clip", 
      "name": "mobilenetv20_features_linearbottleneck1_relu60_relu6", 
      "attrs": {
        "a_max": "6", 
        "a_min": "0"
      }, 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck1_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(48, 1, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mobilenetv20_features_linearbottleneck1_conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "48", 
        "num_group": "48", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[44, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck1_batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(48,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck1_batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(48,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck1_batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(48,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck1_batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(48,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mobilenetv20_features_linearbottleneck1_batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[46, 0, 0], [47, 0, 0], [48, 0, 0], [49, 0, 36], [50, 0, 36]]
    }, 
    {
      "op": "clip", 
      "name": "mobilenetv20_features_linearbottleneck1_relu61_relu6", 
      "attrs": {
        "a_max": "6", 
        "a_min": "0"
      }, 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck1_conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(12, 48, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mobilenetv20_features_linearbottleneck1_conv2_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "12", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[52, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck1_batchnorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(12,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck1_batchnorm2_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(12,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck1_batchnorm2_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(12,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck1_batchnorm2_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(12,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mobilenetv20_features_linearbottleneck1_batchnorm2_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[54, 0, 0], [55, 0, 0], [56, 0, 0], [57, 0, 36], [58, 0, 36]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck2_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(72, 12, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mobilenetv20_features_linearbottleneck2_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "72", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck2_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(72,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck2_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(72,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck2_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(72,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck2_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(72,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mobilenetv20_features_linearbottleneck2_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[61, 0, 0], [62, 0, 0], [63, 0, 0], [64, 0, 36], [65, 0, 36]]
    }, 
    {
      "op": "clip", 
      "name": "mobilenetv20_features_linearbottleneck2_relu60_relu6", 
      "attrs": {
        "a_max": "6", 
        "a_min": "0"
      }, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck2_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(72, 1, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mobilenetv20_features_linearbottleneck2_conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "72", 
        "num_group": "72", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[67, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck2_batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(72,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck2_batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(72,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck2_batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(72,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck2_batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(72,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mobilenetv20_features_linearbottleneck2_batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[69, 0, 0], [70, 0, 0], [71, 0, 0], [72, 0, 36], [73, 0, 36]]
    }, 
    {
      "op": "clip", 
      "name": "mobilenetv20_features_linearbottleneck2_relu61_relu6", 
      "attrs": {
        "a_max": "6", 
        "a_min": "0"
      }, 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck2_conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(12, 72, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mobilenetv20_features_linearbottleneck2_conv2_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "12", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck2_batchnorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(12,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck2_batchnorm2_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(12,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck2_batchnorm2_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(12,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck2_batchnorm2_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(12,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mobilenetv20_features_linearbottleneck2_batchnorm2_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[77, 0, 0], [78, 0, 0], [79, 0, 0], [80, 0, 36], [81, 0, 36]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "mobilenetv20_features_linearbottleneck2_elemwise_add0", 
      "inputs": [[82, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck3_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(72, 12, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mobilenetv20_features_linearbottleneck3_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "72", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[83, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck3_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(72,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck3_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(72,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck3_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(72,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck3_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(72,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mobilenetv20_features_linearbottleneck3_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[85, 0, 0], [86, 0, 0], [87, 0, 0], [88, 0, 36], [89, 0, 36]]
    }, 
    {
      "op": "clip", 
      "name": "mobilenetv20_features_linearbottleneck3_relu60_relu6", 
      "attrs": {
        "a_max": "6", 
        "a_min": "0"
      }, 
      "inputs": [[90, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck3_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(72, 1, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mobilenetv20_features_linearbottleneck3_conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "72", 
        "num_group": "72", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[91, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck3_batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(72,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck3_batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(72,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck3_batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(72,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck3_batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(72,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mobilenetv20_features_linearbottleneck3_batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[93, 0, 0], [94, 0, 0], [95, 0, 0], [96, 0, 36], [97, 0, 36]]
    }, 
    {
      "op": "clip", 
      "name": "mobilenetv20_features_linearbottleneck3_relu61_relu6", 
      "attrs": {
        "a_max": "6", 
        "a_min": "0"
      }, 
      "inputs": [[98, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck3_conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16, 72, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mobilenetv20_features_linearbottleneck3_conv2_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[99, 0, 0], [100, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck3_batchnorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck3_batchnorm2_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck3_batchnorm2_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck3_batchnorm2_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mobilenetv20_features_linearbottleneck3_batchnorm2_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[101, 0, 0], [102, 0, 0], [103, 0, 0], [104, 0, 36], [105, 0, 36]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck4_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(96, 16, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mobilenetv20_features_linearbottleneck4_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "96", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[106, 0, 0], [107, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck4_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(96,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck4_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(96,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck4_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(96,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck4_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(96,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mobilenetv20_features_linearbottleneck4_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[108, 0, 0], [109, 0, 0], [110, 0, 0], [111, 0, 36], [112, 0, 36]]
    }, 
    {
      "op": "clip", 
      "name": "mobilenetv20_features_linearbottleneck4_relu60_relu6", 
      "attrs": {
        "a_max": "6", 
        "a_min": "0"
      }, 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck4_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(96, 1, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mobilenetv20_features_linearbottleneck4_conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "96", 
        "num_group": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[114, 0, 0], [115, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck4_batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(96,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck4_batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(96,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck4_batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(96,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck4_batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(96,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mobilenetv20_features_linearbottleneck4_batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[116, 0, 0], [117, 0, 0], [118, 0, 0], [119, 0, 36], [120, 0, 36]]
    }, 
    {
      "op": "clip", 
      "name": "mobilenetv20_features_linearbottleneck4_relu61_relu6", 
      "attrs": {
        "a_max": "6", 
        "a_min": "0"
      }, 
      "inputs": [[121, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck4_conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16, 96, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mobilenetv20_features_linearbottleneck4_conv2_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[122, 0, 0], [123, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck4_batchnorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck4_batchnorm2_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck4_batchnorm2_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck4_batchnorm2_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mobilenetv20_features_linearbottleneck4_batchnorm2_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[124, 0, 0], [125, 0, 0], [126, 0, 0], [127, 0, 36], [128, 0, 36]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "mobilenetv20_features_linearbottleneck4_elemwise_add0", 
      "inputs": [[129, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck5_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(96, 16, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mobilenetv20_features_linearbottleneck5_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "96", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[130, 0, 0], [131, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck5_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(96,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck5_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(96,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck5_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(96,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck5_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(96,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mobilenetv20_features_linearbottleneck5_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[132, 0, 0], [133, 0, 0], [134, 0, 0], [135, 0, 36], [136, 0, 36]]
    }, 
    {
      "op": "clip", 
      "name": "mobilenetv20_features_linearbottleneck5_relu60_relu6", 
      "attrs": {
        "a_max": "6", 
        "a_min": "0"
      }, 
      "inputs": [[137, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck5_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(96, 1, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mobilenetv20_features_linearbottleneck5_conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "96", 
        "num_group": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[138, 0, 0], [139, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck5_batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(96,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck5_batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(96,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck5_batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(96,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck5_batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(96,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mobilenetv20_features_linearbottleneck5_batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[140, 0, 0], [141, 0, 0], [142, 0, 0], [143, 0, 36], [144, 0, 36]]
    }, 
    {
      "op": "clip", 
      "name": "mobilenetv20_features_linearbottleneck5_relu61_relu6", 
      "attrs": {
        "a_max": "6", 
        "a_min": "0"
      }, 
      "inputs": [[145, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck5_conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16, 96, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mobilenetv20_features_linearbottleneck5_conv2_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[146, 0, 0], [147, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck5_batchnorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck5_batchnorm2_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck5_batchnorm2_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mobilenetv20_features_linearbottleneck5_batchnorm2_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
